using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ProjectTask : MonoBehaviour
{
    #region Задание
    /**
    1 Самостоятельно создать следующие анимации:

        прыжок
        атака укусом
        атака брюшком (дальняя атака, при которой из брюшка будет вылетать объект паутины. Сам объект делать не нужно)


    2 Добавить эти анимации в контроллер и каждую из них привязать к отдельной кнопке внутри управляющего скрипта.

    3 Список задач:

        Настроить контроллер и скрипт таким образом, чтобы при проигрывании анимаций атаки и прыжка нельзя было проиграть другие анимации до конца текущей, какие бы клавиши игрок не нажимал.

        Анимацию прыжка разбить на 3 анимации: отталкивание, полет, приземление. Настроить контроллеры таким образом, чтобы в процессе прыжка вышеперечисленные анимации проигрывались друг за другом в соответствующие моменты.

        В компоненте аниматора убрать галочку Apply root motion и переделать управляющий скрипт и контроллер анимации таким образом, чтобы он управлял анимациями и движением паука. Для перемещения в пространстве можно использовать Rigidbody, Character Controller, либо любой другой вспомогательный компонент.
        Таким образом должна решиться проблема передвижения персонажа по неровным поверхностям, наклонным плоскостям и проходы сквозь стены.

        Добавить анимацию смерти от падения. Если персонаж начинает падать, то включается анимация падения, а затем, в зависимости от высоты, либо анимация приземления, либо анимация смерти.
     */
    

    #endregion
}
